# 参考: https://qiita.com/mogulla3/items/46bb876391be07921743

# 配列表現系
puts "-------------------------  配列表現系  -------------------------"
# &w/%W
# %w [配列を作る]
# 配列を作る。配列の要素はスペース区切りで指定する。
# 式の展開はされない。

array = %w(one two three four)
p array # ["one", "two", "three", "four"]

puts "-------------------------"

array_2 = %w(1 2 3 4)
p array_2

puts "-------------------------"

# %W
# 配列を作る。%w()と違い、式の展開がされる。
ruby = 'Ruby'
PYTHON = 'Python'

array = %W(#{ruby} #{PYTHON} PHP)
p array

puts "-------------------------"
array = %W(#{1+1} #{"1".to_i} test)
p array


puts "-------------------------  文字列表現系  -------------------------"
# 文字列表現系
# %, %Q
Q = %(a b c)
p Q

a, b, c = 1, 2, 3
Q2 = %Q(#{a} #{b} #{c})
p Q2

puts "-------------------------"
# %q
q = %q(a b c)
p q


a, b, c = 1, 2, 3
q2 = %q(#{a} #{b} #{c})
p q2
puts "-------------------------"

# 正規表現
puts "-------------------------  正規表現系  -------------------------"

r = %r(^http://)
p r
